[
    {
        "id": 1459345112772,
        "author": "Muhammad Tamzid",
        "text": "Bangladesh forms the Bengal delta region in the Indian subcontinent, where civilization dates back more than 4,300 years. The borders of present-day Bangladesh were established during the British-partition of Bengal and India in 1947, when the region became East Pakistan, part of the newly formed state of Pakistan. It was separated from West Pakistan by 1,600 km (994 mi) of Indian territory. Due to political, economic and linguistic discrimination, popular agitation and civil disobedience grew against the Pakistani state. Led by Sheikh Mujibur Rahman, the Bengali people increasingly demanded self-determination, culminating in the Bangladesh Liberation War in 1971."
    },
    {
        "id": 1459345236173,
        "author": "Mostafa Kamal",
        "text": "The Vietnamese are descendants of nomadic Mongols from China and migrants from Indonesia. According to mythology, the first ruler of Vietnam was Hung Vuong, who founded the nation in 2879 B.C. China ruled the nation then known as Nam Viet as a vassal state from 111 B.C. until the 15th century, an era of nationalistic expansion, when Cambodians were pushed out of the southern area of what is now Vietnam."
    },
    {
        "id": 1459345410401,
        "author": "Nguyen Binh Dieu",
        "text": "France first unified Vietnam in 1887, when a single governor-generalship was created, followed by the first physical links between north and south—a rail and road system. Even at the beginning of World War II, however, there were internal differences among the three regions. Japan took over military bases in Vietnam in 1940, and a pro-Vichy French administration remained until 1945. Veteran Communist leader Ho Chi Minh organized an independence movement known as the Vietminh to exploit the confusion surrounding France's weakened influence in the region. At the end of the war, Ho's followers seized Hanoi and declared a short-lived republic, which ended with the arrival of French forces in 1946."
    }
]